let data = [//mbti93题
  {
    id: '1',
    title: '我更倾向从以下何处获得力量',
    options1: '朋友和家人',
    options2: '个人的内心想法'
  },
  {
    id: '2',
    title: '大多数人会说你是一个',
    options1: '非常坦诚开放的人',
    options2: '重视自我隐私的人'
  },
  {
    id: '3',
    title: '在社交场合中，你经常会感到',
    options1: '与多数人都能从容长谈',
    options2: '与某些人很难打开话匣和保持对话'
  },
  {
    id: '4',
    title: '你能否滔滔不绝地与人聊天',
    options1: '几乎跟任何人都可以',
    options2: '只限于跟你有共同兴趣的R人'
  },
  {
    id: '5',
    title: '你通常',
    options1: '与人容易混熟',
    options2: '比较沉静和矜持'
  },
  {
    id: '6',
    title: '在一大人群当中，通常是',
    options1: '你介绍大家认识',
    options2: '别人介绍你'
  },
  {
    id: '7',
    title: '和别人容易混熟',
    options1: '你介绍大家认识',
    options2: '趋向自处一隅'
  },
  {
    id: '8',
    title: '你刚认识的朋友能否说出你的兴趣',
    options1: '马上可以',
    options2: '要待他们真正了解你之后才可以'
  },
  {
    id: '9 ',
    title: '你喜欢花很多的时间',
    options1: '和别人在一起',
    options2: '一个人独处'
  },
  {
    id: '10',
    title: '你认为别人一般',
    options1: '用很短的时间便认识你',
    options2: '要花很长时间才认识你'
  },
  {
    id: '11',
    title: '和一群人在一起，你通常会选',
    options1: '参与大伙儿的谈话',
    options2: '跟你很熟络的人个别谈话'
  },
  {
    id: '12',
    title: '你是否',
    options1: '容易让人了解',
    options2: '难于让人了解'
  },
  {
    id: '13',
    title: '与很多人一起会否',
    options1: '令你活力倍增',
    options2: '常常令你心力交瘁'
  },
  {
    id: '14',
    title: '在社交聚会中，你会',
    options1: '是说话很多的一个',
    options2: '让别人多说话'
  },
  {
    id: '15',
    title: '你是否',
    options1: '可以与任何人按需要从容地交谈',
    options2: '只是对某些人或在某种情况下才可以畅所欲言'
  },
  {
    id: '16',
    title: '我更倾向于',
    options1: ' 坦率开放',
    options2: '着重隐私'
  },
  {
    id: '17',
    title: '选择较符合你的词',
    options1: ' 外向',
    options2: '文静'
  },
  {
    id: '18',
    title: '我更倾向于',
    options1: '健谈',
    options2: '矜持'
  },
  {
    id: '19',
    title: '选择较符合你的词',
    options1: '朋友众多',
    options2: '朋友不多'
  },
  {
    id: '20',
    title: '你更倾向于',
    options1: '爱合群',
    options2: '文静'
  },
  {
    id: '21',
    title: '选择较符合你的词',
    options1: '热衷',
    options2: '文静'
  },
  {
    id: '22',
    title: '假如你是一位老师，你会选择',
    options1: '以事实为主的课程',
    options2: '涉及理论的课程'
  },
  {
    id: '23',
    title: '你宁愿被人认为是一个',
    options1: '实事求是的人',
    options2: '机灵的人'
  },
  {
    id: '24',
    title: '要做许多人也做的事，你比较喜欢',
    options1: '按照认可的方法去做',
    options2: '构想一个自己的方法'
  },
  {
    id: '25',
    title: '你会',
    options1: '跟随一些证明有效地方法',
    options2: '分析还有什么毛病，及针对尚未解决的难题'
  },
  {
    id: '26',
    title: '一般来说，你和哪些人比较合得来',
    options1: ' 现实的人',
    options2: '富于想象力的人'
  },
  {
    id: '27',
    title: '你会跟哪些人做朋友',
    options1: '脚踏实地的',
    options2: '常提出新主意的'
  },
  {
    id: '28',
    title: '哪些人会更吸引你',
    options1: '实事求是，具丰富常识的人',
    options2: '一个思想敏捷及非常聪颖的人'
  },
  {
    id: '29',
    title: '你通常较喜欢的科目是',
    options1: '讲授事实和数据的',
    options2: '讲授慨念和原则的'
  },
  {
    id: '30',
    title: '为乐趣而阅读时，你会',
    options1: '喜欢作者直话直说',
    options2: '喜欢奇特或创新的表达方式'
  },
  {
    id: '31',
    title: '你更倾向于选择哪组词',
    options1: '具体',
    options2: '抽象'
  },
  {
    id: '32',
    title: '你更倾向于选择哪组词',
    options1: '肯定',
    options2: '理论'
  },
  {
    id: '33',
    title: '你更倾向于选择哪组词',
    options1: '实况',
    options2: '意念'
  },
  {
    id: '34',
    title: '你更喜欢',
    options1: '以事论事',
    options2: '富想象的'
  },
  {
    id: '35',
    title: '你更倾向与相信',
    options1: '事实',
    options2: '理论'
  },
  {
    id: '36',
    title: '你更倾向于选择',
    options1: '真实的',
    options2: '想象的'
  },
  {
    id: '37',
    title: '你更善于考虑事件的',
    options1: '必然性',
    options2: '可能性'
  },
  {
    id: '38',
    title: '你对怎样的事物更有兴趣',
    options1: ' 已知的',
    options2: '新颖的'
  },
  {
    id: '39',
    title: '你更倾向于选择',
    options1: '事实',
    options2: '意念'
  },
  {
    id: '40',
    title: '你更倾向于选择',
    options1: '声明',
    options2: '概念'
  },
  {
    id: '41',
    title: '选择较符合你的词',
    options1: '务实的',
    options2: '理论的'
  },
  {
    id: '42',
    title: '你对以下哪组词更有兴趣',
    options1: '建造',
    options2: '发明'
  },
  {
    id: '43',
    title: '选择较符合你的词',
    options1: ' 合情合理',
    options2: '令人着迷'
  },
  {
    id: '44',
    title: '你更倾向于选择',
    options1: ' 制作',
    options2: '设计'
  },
  {
    id: '45',
    title: '你更倾向于选择',
    options1: ' 制造',
    options2: '创造 '
  },
  {
    id: '46',
    title: '你更倾向于选择',
    options1: '具体的',
    options2: '创新 '
  },
  {
    id: '47',
    title: '你更倾向于选择',
    options1: '实际',
    options2: '抽象的 '
  },
  {
    id: '48',
    title: '你是否经常让',
    options1: '你的理智主宰你的情感',
    options2: '你的情感支配你的理智 '
  },
  {
    id: '49',
    title: '你倾向',
    options1: '重视逻辑多于情感',
    options2: '重视感情多于逻辑 '
  },
  {
    id: '50',
    title: '哪个是较高的赞誉，获称评为',
    options1: '一贯理性的人',
    options2: '一贯感性的人 '
  },
  {
    id: '51',
    title: '你宁替哪一类上司（或老师）工作',
    options1: '言辞尖锐但永远合逻辑的',
    options2: '天性淳良，但常常前后不一的 '
  },
  {
    id: '52',
    title: '哪个是较高的赞誉，获称评为',
    options1: ' 能干的',
    options2: '富有同情心的 '
  },
  {
    id: '53',
    title: '要做决定时，你认为比较重要的是',
    options1: ' 据事实衡量',
    options2: '考虑他人的感受和意见 '
  },
  {
    id: '54',
    title: '选择更符合你的词',
    options1: ' 坚定',
    options2: '温柔 '
  },
  {
    id: '55',
    title: '选择更符合你的词',
    options1: ' 公正',
    options2: '敏感 '
  },
  {
    id: '56',
    title: '选择更符合你的词',
    options1: ' 远见',
    options2: '同情怜悯 '
  },
  {
    id: '57',
    title: '选择更符合你的词',
    options1: ' 客观的',
    options2: '亲切的 '
  },
  {
    id: '58',
    title: '选择更符合你的词',
    options1: ' 合逻辑',
    options2: '富同情 '
  },
  {
    id: '59',
    title: '选择更符合你的词',
    options1: ' 合逻辑',
    options2: '富同情 '
  },
  {
    id: '60',
    title: '选择更符合你的词',
    options1: ' 合逻辑',
    options2: '富同情 '
  },
  {
    id: '61',
    title: '选择更符合你的词',
    options1: ' 分析',
    options2: '同情 '
  },
  {
    id: '62',
    title: '选择更符合你的词',
    options1: ' 有决心的',
    options2: '全心投入的 '
  },
  {
    id: '63',
    title: '你更倾向于',
    options1: ' 思考',
    options2: '感受 '
  },
  {
    id: '64',
    title: '你更倾向于选择',
    options1: '  令人信服',
    options2: '感人的 '
  },
  {
    id: '65',
    title: '你更倾向于选择',
    options1: '利益',
    options2: '祝福 '
  },
  {
    id: '66',
    title: '选择更符合你的词',
    options1: '客观的',
    options2: '热情的 '
  },
  {
    id: '67',
    title: '选择更符合你的词',
    options1: '具分析力',
    options2: '多愁善感 '
  },
  {
    id: '68',
    title: '选择更符合你的词',
    options1: ' 公正的',
    options2: '有关怀心 '
  },
  {
    id: '69',
    title: '选择更符合你的词',
    options1: ' 实际',
    options2: '多愁善感 '
  },
  {
    id: '70',
    title: '选择更符合你的词',
    options1: ' 坚持己见',
    options2: '温柔有爱心 '
  },
  {
    id: '71',
    title: '选择更符合你的词',
    options1: ' 能干',
    options2: ' 仁慈  '
  },
  {
    id: '72',
    title: '当你要出外一整天，你会不会',
    options1: ' 计划你要做什么和在什么时候做',
    options2: ' 说去就去  '
  },
  {
    id: '73',
    title: '当你有一份特别的任务，你会喜欢',
    options1: ' 开始前小心组织计划',
    options2: ' 边做边找须做什么  '
  },
  {
    id: '74',
    title: '你比较喜欢',
    options1: ' 很早便把约会、社交聚集等事情安排妥当',
    options2: ' 无拘无束，看当时有什么好玩就做什么  '
  },
  {
    id: '75',
    title: '当你要在一个星期内完成一个大项目，你在开始时候就会',
    options1: ' 把要做的不同工作依次列出',
    options2: ' 马上动工 '
  },
  {
    id: '76',
    title: '你通常喜欢',
    options1: ' 事先安排你的社交约会',
    options2: ' 随兴之所至做事 '
  },
  {
    id: '77',
    title: '你认为自己是一个',
    options1: '  较为有条理的人',
    options2: ' 较为随兴所至的人 '
  },
  {
    id: '78',
    title: '在大多数情况下，你会选择',
    options1: '  程序表做事',
    options2: '  顺其自然 '
  },
  {
    id: '79',
    title: '总的来说，要做一个大型作业时，你会选',
    options1: '  首先把工作按步细分',
    options2: '  边做边想该做什么 '
  },
  {
    id: '80',
    title: '计划一个旅程时，你较喜欢',
    options1: '  首先把工作按步细分',
    options2: '  边做边想该做什么 '
  },
  {
    id: '81',
    title: '处理许多事情上，你会喜欢',
    options1: '  按照计划行事',
    options2: '  凭兴所至行事 '
  },
  {
    id: '82',
    title: '你比较喜欢',
    options1: ' 很早就做计划',
    options2: ' 坐观事情发展才做计划 '
  },
  {
    id: '83',
    title: '在日常工作中，你会',
    options1: ' 通常预先计划，以免要在压力下工作',
    options2: '  颇为喜欢处理迫使你分秒必争的突发事件 '
  },
  {
    id: '84',
    title: '你认为按照程序表做事',
    options1: ' 大多数情况下是有帮助而且是你喜欢做的',
    options2: '  有时是需要的，但一般来说你不大喜欢这样做 '
  },
  {
    id: '85',
    title: '你做事多数是',
    options1: ' 照拟好的程序表去做',
    options2: '按当天心情去做'
  },
  {
    id: '86',
    title: '按照程序表做事',
    options1: ' 合你心意',
    options2: '令你感到束缚'
  },
  {
    id: '87',
    title: '把在周末期间要完成的事列成清单，这个主意会',
    options1: ' 合你意',
    options2: '使你提不起劲'
  },
  {
    id: '88',
    title: '你更倾向于哪个',
    options1: ' 预先安排的',
    options2: '无计划的'
  },
  {
    id: '89',
    title: '你更倾向于哪个',
    options1: ' 有系统的',
    options2: '随意'
  },
  {
    id: '90',
    title: '你更倾向于哪个',
    options1: ' 有条不紊',
    options2: '不拘小节'
  },
  {
    id: '91',
    title: '你更倾向于哪个',
    options1: ' 有系统',
    options2: '即兴'
  },
  {
    id: '92',
    title: '你更倾向于哪个',
    options1: ' 决定',
    options2: '冲动'
  },

]

let data1 = [
  {
    id: '1',
    title: '认识你的人倾向形容你为',
    options1: '热情和敏感。',
    options2: '逻辑和明确。'
  },
  {
    id: '2',
    title: '下列哪一件事听起来比较吸引你？ ',
    options1: '与恋人到有很多人且社交活动频繁的地方。',
    options2: '呆在家中与恋人做一些特别的事情，例如说观赏一部有趣的录影带并享用你最喜欢的外卖食物。'
  },
  {
    id: '3',
    title: '下列哪一件事听起来比较吸引你？ ',
    options1: '与恋人到有很多人且社交活动频繁的地方。',
    options2: '呆在家中与恋人做一些特别的事情，例如说观赏一部有趣的录影带并享用你最喜欢的外卖食物。'
  },
  {
    id: '4',
    title: '你倾向通过以下哪种方式收集信息:',
    options1: '你对有可能发生之事的想像和期望。',
    options2: '你对目前状况的实际认知。'
  },
  {
    id: '5',
    title: '哪种特质更像你:',
    options1: '友善而仁慈。 ',
    options2: '冷静而理智。'
  },
  {
    id: '6',
    title: '当和某人分手时:',
    options1: '你通常让自己的情绪深陷其中，很难抽身出来。   ',
    options2: '虽然你觉得受伤，但一旦下定决心，你会直截了当地将过去恋人的影子甩开。'
  },
  {
    id: '7',
    title: '当与一个人交往时，你倾向于看重:',
    options1: '情感上的相容性：表达爱意和对另一半的需求很敏感。  ',
    options2: '智慧上的相容性：沟通重要的想法；客观地讨论和辩论事情。'
  },
  {
    id: '8',
    title: '你倾向拥有:',
    options1: '很多认识的人和很亲密的朋友。',
    options2: '一些很亲密的朋友和一些认识的人。'
  },
  {
    id: '9',
    title: '过去，你的爱人和恋人倾向对你说：',
    options1: '你难道不可以安静一会儿吗？',
    options2: '可以请你从你的世界中出来一下吗？  '
  },
  {
    id: '9',
    title: '当你对一个约会觉得放心时，你偏向谈论：',
    options1: '未来，关于改进或发明事物和生活的种种可能性。',
    options2: '实际的、具体的、关于“此时此地”的事物。例如，你也许会谈论品酒的好方法，或你即将要参加的新奇旅程。 '
  },
  {
    id: '10',
    title: '你倾向相信：',
    options1: '你的直觉。',
    options2: '你直接的观察和现成的经验。'
  },
  {
    id: '11',
    title: '在约会中，你通常：',
    options1: '整体来说很健谈。',
    options2: '较安静并保留，直到你觉得舒服。'
  },
  {
    id: '12',
    title: '在第一次约会中',
    options1: '若你所约的人来迟了，你会很不高兴。',
    options2: '一点儿都不在乎，因为你自己常常迟到。'
  },
  {
    id: '13',
    title: '当你置身于一段关系中时，你倾向相信：',
    options1: '永远有进步的空间。',
    options2: ' 若它没有被破坏，不予修补。'
  },
  {
    id: '14',
    title: '哪一项较常见：',
    options1: '你准时出席而其他人都迟到。',
    options2: '  其他人都准时出席而你迟到。'
  },
  {
    id: '15',
    title: '你是这种人:',
    options1: '喜欢先纵观全局。',
    options2: ' 喜欢先掌握细节'
  },
  {
    id: '16',
    title: '过去，你遇见你大部分的恋人是：',
    options1: ' 在宴会中、夜总会、工作上、休闲活动中、会议上或当朋友介绍我给他们的朋友时。',
    options2: ' 通过私人的方式，例如个人广告、录影约会，或是由亲密的朋友和家人介绍。'
  },
  {
    id: '17',
    title: '你是这类型的人：',
    options1: ' 与其活在现实中，不如活在想像里。',
    options2: ' 与其活在想像里，不如活在现实中。'
  },
  {
    id: '18',
    title: '当你参加一个社交聚会时，你会：',
    options1: ' 在夜色很深时，一旦你开始投入，也许就是最晚离开的那一个。 ',
    options2: ' 在夜晚刚开始的时候，我就疲倦了并且想回家。  '
  },
  {
    id: '19',
    title: '当你不同意恋人的想法时：',
    options1: ' 你尽可能地避免伤害对方的感情；若是会对对方造成伤害的话，你就不会说。 ',
    options2: '  你通常毫无保留地说话，并且对情人直言不讳，因为对的就是对的。   '
  },
  {
    id: '20',
    title: '当你不同意恋人的想法时：',
    options1: ' 你尽可能地避免伤害对方的感情；若是会对对方造成伤害的话，你就不会说。 ',
    options2: '  你通常毫无保留地说话，并且对情人直言不讳，因为对的就是对的。   '
  },
  {
    id: '21',
    title: '你偏好：',
    options1: ' 事先知道约会的行程：要去哪里、有谁参加、你会在那里多久、该如何打扮。 ',
    options2: '  让约会自然地发生，不做太多事先的计划。   '
  },
  {
    id: '22',
    title: '你是此类型的人：',
    options1: ' 喜欢在一段时间里专心于一件事情直到完成。 ',
    options2: '  享受同时进行好几件事情。   '
  },
  {
    id: '23',
    title: '你是此类型的人：',
    options1: ' 喜欢在一段时间里专心于一件事情直到完成。 ',
    options2: '  享受同时进行好几件事情。   '
  },
  {
    id: '24',
    title: '你倾向如此做决定：',
    options1: ' 首先依你的心意，然后依你的逻辑。',
    options2: '  享受同时 首先依你的逻辑，然后依你的心意。 进行好几件事情。   '
  },
  {
    id: '25',
    title: '你倾向从何处得到力量：',
    options1: ' 朋友。',
    options2: '   自己的想法。   '
  },
  {
    id: '26',
    title: '你通常：',
    options1: ' 偏向于去想像一大堆关于即将来临的约会的事情。',
    options2: '    偏向于拘谨地想象即将来临的约会，只期待让它自然地发生。   '
  },
  {
    id: '27',
    title: '当你参加一个社交聚会时，你会：',
    options1: ' 在夜色很深时，一旦你开始投入，也许就是最晚离开的那一个。 ',
    options2: '    在夜晚刚开始的时候，我就疲倦了并且想回家。   '
  },
  {
    id: '28',
    title: '当你不同意恋人的想法时：',
    options1: ' 你尽可能地避免伤害对方的感情；若是会对对方造成伤害的话，你就不会说。 ',
    options2: '   你通常毫无保留地说话，并且对情人直言不讳，因为对的就是对的。   '
  },
  {
    id: '29',
    title: '你倾向比较能够察觉到：',
    options1: ' 当人们需要情感上的支持时。 ',
    options2: ' 当人们不合逻辑时。   '
  },
  {
    id: '30',
    title: '若你有时间和金钱，你的朋友邀请你到国外度假，并且在前一天才通知，你会：',
    options1: '  必须先检查你的时间表。 ',
    options2: ' 立刻收拾行装。     '
  },
  {
    id: '30',
    title: '你选择的生活充满着：',
    options1: '  日程表和组织。 ',
    options2: ' 自然发生和弹性。     '
  },
  {
    id: '31',
    title: '你是这种喜欢……的人：',
    options1: '   下定决心并且做出最后肯定的结论。 ',
    options2: '  放宽你的选择面并且持续收集信息。     '
  }
]

let data2 = [
  {
    name: 'ISTJ',
    con: '详尽、精确、系统、勤劳,关注细节。致力于改善组织程序与过程,无论组织处在发展的顺境还是逆境,都对组织保持忠诚。',
    con1: [
      {
        title: '对组织的贡献',
        con1_1: '1平稳地、按计划完成组织任务',
        con1_2: '2重视细节并慎重处理',
        con1_3: '3做事力尽完美 ',
        con1_4: '4重信用,并具有坚持性',
        con1_5: '5在组织里工作倍感舒适领导模式1以事实和经验做决定',
      }
    ],
    con2: [{
      title: '领导模式',
      con2_1: '1以事实和经验做决定',
      con2_2: '2建立可靠、稳定、持续的工作绩效',
      con2_3: '3尊重传统和等级制度',
      con2_4: '4奖励遵循规则完成任务的员工',
      con2_5: '5关注组织的即时性和实际性需要',
    }],
    con3: [
      {
        title: '学习模式',
        con3_1: '具体 , 有序的学习模式',
        con3_2: '对目前有实际应用的学习模式',
      }
    ],
    con4: [
      {
        title: '倾向性顺序',
        con4_1: '感觉',
        con4_2: '思维',
        con4_3: '情感',
        con4_4: '直觉'
      },

    ],
    con5: [
      {
        title: '解决问题模式',
        con5_1: '喜欢与现实、工作努力、关注事实和结果的人共事',
        con5_2: '为获得理想结果，需考虑对人们的影响，然后寻找更多的可能性和其它含义'
      }
    ],
    con6: [
      {
        title: '发展建议',
        con6_1: '除了关注现实问题，需关注更深远的、定向于未来的问题',
        con6_2: '需考虑人的因素，向他人表达其应得的赞赏',
        con6_3: '为避免陈规，尝试寻找新的选择',
        con6_4: '需培养耐心，应付那些需要用不同方式沟通或忽视规则和程序的人'
      }
    ]
  },
  {
    name: 'ISTP',
    con: '注重实用性，尊重事实，寻求有利方法，具有现实性，只信服被论证的结果。喜欢独立工作，依靠逻辑和足智多谋解决即时出现的组织问题。',
    con1: [
      {
        title: '对组织的贡献',
        con1_1: '在需要的场合，是解决麻烦问题的能手',
        con1_2: '在感兴趣的领域里，发挥行走的信息库的作用',
        con1_3: '计算出克服障碍、完成任务的最实际的途径 ',
        con1_4: '在危机中保持镇定，发挥安抚他人情绪的作用',
        con1_5: '在规划中增加其专业领域里的知识和技能',
      }
    ],
    con2: [{
      title: '领导模式',
      con2_1: '以身作则',
      con2_2: '一视同仁，尊重每个人的价值',
      con2_3: '面临麻烦时，采用最有利的方法做出快速反应',
      con2_4: '宽松管理员工，喜欢最少监督自己',
      con2_5: '采用明晰、理性的管理原则',
    }],
    con3: [
      {
        title: '学习模式',
        con3_1: '生动性、娱乐性的学习模式',
        con3_2: '对有用的内容和有实际应用的学习内容感兴趣',
      }
    ],
    con4: [
      {
        title: '倾向性顺序',
        con4_1: '思维',
        con4_2: '感觉',
        con4_3: '直觉',
        con4_4: '情感'
      },

    ],
    con5: [
      {
        title: '解决问题模式',
        con5_1: '喜欢依据具体事实以自身具有的内部逻辑构建问题和解决问题',
        con5_2: '为获得理想结果，需要考虑其它可能性和对人们的影响'
      }
    ],
    con6: [
      {

        title: '发展建议',
        con6_1: '需要增强开放性，关心他人，与他人共享信息',
        con6_2: '需发展坚持性，改变沟通模式',
        con6_3: '加强计划性，付出更多努力获取想要的成功',
        con6_4: '需发展设置和保持目标的方法'
      }
    ]
  },
  {
    name: 'ESTP',
    con: '行为定向型，讲究实效、足智多谋、注重现实，以最有效的途径解决问题。喜欢事件即时发生，然后在复杂的情境中找到解决问题的方法。',
    con1: [
      {
        title: '对组织的贡献',
        con1_1: '采用协商的方式使任务顺利完成',
        con1_2: '保持组织运作的活跃状态，促使变化发生',
        con1_3: '运用直接和现实的工作方式 ',
        con1_4: '评估风险',
        con1_5: '注意和记忆事实信息',
      }
    ],
    con2: [{
      title: '领导模式',
      con2_1: '对危机中的管理有充分准备',
      con2_2: '说服他人接受自己的观点',
      con2_3: '直率、自信的领导方式',
      con2_4: '按最有利的路径进行组织工作',
      con2_5: '重视行动和即时结果',
    }],
    con3: [
      {
        title: '学习模式',
        con3_1: '主动型、间接经验型、尝试错误型的学习方式',
        con3_2: '实际型，注意力集中在即刻能应用的学习内容',
      }
    ],
    con4: [
      {
        title: '倾向性顺序',
        con4_1: '感觉',
        con4_2: '思维',
        con4_3: '情感',
        con4_4: '直觉'
      },

    ],
    con5: [
      {
        title: '解决问题模式',
        con5_1: '喜欢现实、具体地评估环境，然后用逻辑分析以后采取的步骤',
        con5_2: '为获得理想结果，会考虑对人们的影响，寻找其它可选择的可能性'
      }
    ],
    con6: [
      {

        title: '发展建议',
        con6_1: '需抑制自己的任务型定向，分析他人的情绪感受',
        con6_2: '需在快速决定之前，事先计划，考虑更多的因素',
        con6_3: '需完成眼前的任务',
        con6_4: '需以适当的观点看待工作和娱乐'
      }
    ]
  },
  {
    name: 'ESTJ',
    con: '理智、善分析、果断、意志坚定，以系统化的方式组织具体事实。喜欢事先组织细节和操作程序与他人一起完成任务',
    con1: [
      {
        title: '对组织的贡献',
        con1_1: '事先察觉、指出、修正不足之处',
        con1_2: '以逻辑的、客观的方式评论规划',
        con1_3: '组织规划、生产、人力要素，实现组织目标',
        con1_4: '监督工作以确保任务正确完成',
        con1_5: '以逐步进行的方式坚持到底',
      }
    ],
    con2: [{
      title: '领导模式',
      con2_1: '直接领导，快速管理',
      con2_2: '运用过去经验解决问题',
      con2_3: '直接、明确地识别问题的核心',
      con2_4: '决策和执行决策非常迅速',
      con2_5: '传统型领导，尊重组织内部的等级和组织获得的成就',
    }],
    con3: [
      {
        title: '学习模式',
        con3_1: '积极主动型，学习间接经验，采用结构化的学习方式',
        con3_2: '实际型，关注他们能运用的学习内容',
      }
    ],
    con4: [
      {
        title: '倾向性顺序',
        con4_1: '思维',
        con4_2: '感觉',
        con4_3: '直觉',
        con4_4: '情感'
      },

    ],
    con5: [
      {
        title: '解决问题模式',
        con5_1: '喜欢根据相关的事实和细节进行逻辑分析，从而控制情境',
        con5_2: '为达到理想结果，会考虑更广阔的前景以及对人们和自己的影响'
      }
    ],
    con6: [
      {

        title: '发展建议',
        con6_1: '决策之前需考虑各种因素，包括人的因素',
        con6_2: '需要促使自己看到他人要求变革而获得的利益',
        con6_3: '需做特别的努力学会赞赏别人',
        con6_4: '需从工作中抽点时间考虑和识别自己的情感和价值观'
      }
    ]
  },


]

module.exports = {
  data_93: data,
  data_31: data1,
  random_test:data2
}